Repository: tomek45/MajaStromka
Catalog: WebsitePorfolio/Resources/HomeTexts.*.resx
Languages: pl

# AboutMeContent
source: Hi! My name is Tomek and I live in Poland. I am currently studing at post-diploma studies focused on .NET technologies and programming using C# in which I am excceptionally interested. I have a Master degree in Mechanical Engineering and Bachelor degree in PowerEngineering. I have spent one year in Portugal as Erasmus+ student, studying Sustainable Energies. I love to travel and I had two bigger journeys by hitchiking (from Poland to Greece and Italy). Also my hobbies are solving programming riddles, surfing/bodyboarding, reading and learning more.
pl: Cześć! Nazywam się Tomek i mieszkam w Polsce. Aktualnie studiuję na studiach podyplomowych na kierunku Technologie ICT i Programowanie ucząc się technologii .Net z wykorzystaniem języka programowania C#. Ukończyłem studia magisterskie na kierunku Mechanika i Budowa Maszyn oraz inżynierskie z Energetyki. Spędziłęm rok na wymianie Erasmus+ ucząc się tam na wydziale Zrównoważonych Energii. Uwielbiam podróżować a ten fakt potwierdzają moję dwie większe wyprawy autostopowe do Grecji i Włoch. Moimi hobby jest rozwiązywanie łamigłówek programistycznych, surfing/bodyboarding, czytanie jak i poszerzanie wiedzy.

# AboutMeTitle
source: About me
pl: Coś o sobie

# CertificateTitle
source: Certificates
pl: Certyfikaty

# CertificateTitle12
source: Udemy Object Oriented Programming
pl: Udemy Programowanie Obiektowe w C#

# CertificateTitle14
source: Portuguese language course certificate
pl: Kurs z języka portugalskiego (30 godzinny)

# CertificateTitle4
source: SoloLearn HTML Fundamentals
pl: SoloLearn podstawy HTML

# CertificateTitle5
source: Linux fundamentals certificate
pl: Kurs podstaw Linux'a

# CertificateTitle6
source: Udemy Unity game development
pl: Kurs Udemy game development

# CertificateTitle9
source: Udemy Introduction to Git and HitHub
pl: Udemy wprowadzenie do Git i HitHub

# City
source: Bialystok, Poland
pl: Białystok, Polska

# ContactTitle
source: Contact
pl: Kontakt

# EducationField1
source: ICT technology and programming
pl: Technologie ICT i Programowanie

# EducationField2
source: Sustainable Energies
pl: Zrównoważone Energie

# EducationField3
source: Master Degree in Mechanical Engineering
pl: Studia magisterskie Mechanika i Budowa Maszyn

# EducationField4
source: Bachelor Degree in Power Engineering
pl: Studia inżynierskie Energetyka

# EducationTitle
source: Education
pl: Edukacja

# ExperienceTitle
source: Working experience
pl: Doświadczenie

# HomeTitle
source: Main page
pl: Strona główna

# Intro
source: Hi, I am Tomek
pl: Witaj! Nazywam się Tomek

# Job2
source: Enea S.A. Production
pl: Enea S.A. Produkcja

# JobDescription1
source: Summer job in England.
pl: Wakacyjna praca w Anglii.

# JobDescription2
source: Internship at power plant in Bialystok city.
pl: Praktyka w elektrociepłowni Białystok.

# JobPosition1
source: Warehousing
pl: Pracownik magazynu

# JobPosition2
source: Internship
pl: Praktykant

# JobYear1
source: 2015 June - 2015 September
pl: 2015 Czerwiec - 2015 Wrzesień

# JobYear2
source: 2014 July - 2014 August
pl: 2014 Lipiec - 2014 Sierpień

# Language1
source: Polish (Native)
pl: Polski (Język Ojczysty)

# Language2
source: English (B2 according to CEFR)
pl: Angielski (B2 zgodnie z CEFR)

# Language3
source: Greek, Portuguese (Beginner)
pl: Grecki (Początkujący)

# LanguagesTitle
source: Languages
pl: Języki

# School1
source: Bialystok University of Technology
pl: Politechnika Białostocka

# School3
source: Bialystok University of Technology
pl: Politechnika Białostocka

# School4
source: Bialystok University of Technology
pl: Politechnika Białostocka

# SchoolDescription1
source: Post diploma studies about programming in C# language using .Net technologies. Including basic concepts of IT.
pl: Studia podyplomowe na temat programowania w języku C# z wykorzystaniem technologii .Net z uwzględnieniem podstaw informatyki.

# SchoolDescription2
source: Participation in student exchange programme "Erasmus+" in Portugal for one year.
pl: Udział w programie wymiany studenckiej Erasmus+ w Portugalii. Studia opierające się o aspekty ekologiczne w energetyce.

# SchoolDescription3
source: Specialization in Technology of heating, refrigeration and air conditioning finished with mark 4.5 (B). Thesis susbject "Computer-aided analysis of heat exchange processes on finned surfaces." using SolidWorks Software.
pl: Specjalizacja technika cieplna, chłodzenie i klimatyzacja. Studia ukończone z oceną 4,5. Temat pracy magisterskiej "Wspomagana komputerowo analiza wymiany ciepła na powierzchniach ożebrowanych" z wykorzystaniem środowiska SolidWorks.

# SchoolDescription4
source: Specialization in energy transfer and production finished with mark 4 (C). Thesis susbject "Project of ground heat exchanger" using SolidWorks Software.
pl: Specjalizacja przesyłu i wytwarzania energii ukończona z oceną 4. Temat pracy inżynierskiej "Projekt gruntowego wymiennika ciepła" przy użyciu oprogramowania SolidWorks.

# SchoolYears1
source: 2017 October - 2018 June
pl: 2017 Październik - 2018 Czerwiec

# SchoolYears2
source: 2016 September - 2017 July
pl: 2016 Wrzesień - 2017 Lipiec

# SchoolYears3
source: 2016 February - 2018 November
pl: 2016 Luty - 2018 Listopad

# SchoolYears4
source: 2011 September - 2015 March
pl: 2011 Wrzesień - 2015 Marzec

source: See all...
pl: Zobacz więcej...

# SkillsContent1
source: C# programming language
pl: Język programowania C#

# SkillsContent2
source: Solidworks (+flow simulation)
pl: Solidworks (z dodatkiem flow simulation)

# SkillsContent4
source: Basic knowledge in .Net Framework (WPF, MVC), Oracle Database SQL, Linux, Html, XML, XAML
pl: Podstawowa wiedza w .Net Framework (WPF, MVC), Oracle Database SQL, Linux, Html, XML, XAML

# SkillsContent5
source: Familiarity with Git, GitHub, Unity Engine, Android Studio, Android, Photoshop, Sony Vegas Pro, Catia
pl: Podstawowa znajomość: Git, GitHub, Unity Engine, Android Studio, Android, Photoshop, Sony Vegas Pro, Catia

# SkillsContent6
source: Knowledge in renewable energies, heat transfer, climatization and energy production gained through cycle of studies.
pl: Wiedza z zakresu energii odnawialnych, przepływu ciepła, klimatyzacji i produkcji energii konwencjonalnej zdobyta podczas studiów.

# SkillsTitle
source: Skills
pl: Umiejętności
